# St7SetModeDampingRatio

Sets the modal damping ratio for the specified mode in the modal superposition file.

long St7SetModeDampingRatio(long uID, long ModeNum, double Ratio)

Input Parameters

uID

Strand7 model file ID.

ModeNum

Mode number.

Ratio

Modal damping ratio.

Applicability

Applicable to harmonic response and linear transient dynamic analysis with mode superposition.